#include "D_800AFE8C_A71FC_type.h"
#include "EepromSaveData_type.h"
#include "assets.h"
#include "common.h"
#include "core/session_manager.h"
#include "graphics/graphics.h"
#include "race/race_session.h"
#include "story/map_events.h"
#include "system/controller_io.h"
#include "system/task_scheduler.h"
#include "text/font_render.h"

extern void initSaveSlotStatSprites(void *);
extern void initSaveSlotItemIcons(void *);
extern void initSaveSlotItemLabels(void *);
extern void initSaveSlotNameText(void *);
extern void initSaveSlotPromptText(void *);
extern void initSaveSlotSelectionParticles(void *);
extern void initSaveSlotIconGrid(void *);
extern void initSaveSlotDeleteArrow(void *);
extern void initSaveSlotGoldDisplay(void *);
extern void initSaveSlotConfirmationIndicator(void *);
extern void initSaveSlotDeleteText(void *);

extern void eepromWriteAsync(s32 slotIndex);
extern s32 pollEepromWriteAsync(void);
extern s32 gControllerInputs;

u8 eeprom_save_magic[16] = "SNOW2EEP";

void updateSaveSlotSelectionScreen(void);
void initSaveSlotSelection(void);
void onSaveSlotSelectionConfirm(void);
void onSaveSlotSelectionCancel(void);
void cleanupSaveSlotSelectionAndExit(void);
void updateSelectionWiggle(void);
void onSaveSlotReadComplete(u16, s32);
void verifySaveSlotChecksum(void);
void updateSlotSelectionSlide(void);

typedef struct {
    u8 pad[0xD0];
    u8 slotIndex;
} SaveSlotStatSpritesReturnType;

typedef struct {
    u8 pad[0x1C];
    u8 slotIndex;
} SaveSlotNameTextReturnType;

typedef struct {
    ViewportNode unk0;
    ViewportNode slotModels[4];
    EepromSaveData_type slotData[4];
    void *unkAA8;
    void *unkAAC;
    void *unkAB0;
    void *unkAB4;
    void *unkAB8;
    s16 slideOffset;
    s16 unkABE;
    s16 selectionY;
    u16 selectionBaseY;
    u16 selectionAnimState;
    u16 menuState;
    u8 saveSlotIndex;
    u8 hasSaveData;
    u8 eepromOperationStatus;
    u8 promptMode;
    u8 numValidSlots;
    u8 eepromErrorStatus;
    u8 slotHasData[3];
    u8 originalSlotDataFlag;
    u8 writeSlotIndexPlusOne;
    u8 menuAnimOffsetX;
    u8 menuChoiceIndex;
    u8 menuType;
    u8 menuSelection;
    u8 savedSlotIndex;
    u8 animDelayCounter;
} SaveSlotScreenState;

typedef struct {
    u8 pad[0xF0];
    u8 slotIndex;
} SaveSlotItemLabelsReturnType;

typedef struct {
    u8 pad[0x48];
    u8 particleIndex;
} SaveSlotParticlesReturnType;

typedef struct {
    u8 padding1[0x938];           // 0x000
    EepromSaveData_type slots[4]; // 0x938
    u8 padding2[0x1C];            // 0xAA8
    u16 readSlotIndex;            // 0xAC4
    u8 padding3[2];               // 0xAC6
    u8 saveSlotIndex;             // 0xAC8
    u8 padding4[3];               // 0xAC9
    u8 numValidSlots;             // 0xACC
    u8 eepromErrorStatus;         // 0xACD
    u8 slotHasData[8];            // 0xACE
} SaveData;

s32 sanitizeSaveSlotData(EepromSaveData_type *saveData);

void initSaveSlotScreen(void) {
    SaveSlotScreenState *state;
    s32 i;
    s32 xOffset;
    s32 xPos;
    SaveSlotStatSpritesReturnType *statTask;
    SaveSlotNameTextReturnType *nameTask;
    void (*handler)(void);
    s32 probeResult;

    state = (SaveSlotScreenState *)allocateTaskMemory(0xAE0);
    setupTaskSchedulerNodes(0x14, 0x14, 0x14, 0, 0, 0, 0, 0);
    clearMemory((s8 *)state, 0xAE0);

    state->menuState = 0x28;
    state->saveSlotIndex = 3;
    state->slideOffset = -0x140;
    state->unkABE = -0x58;
    state->selectionAnimState = 0;
    state->numValidSlots = 0;
    state->selectionY = -0xE0;
    state->writeSlotIndexPlusOne = 0;
    state->menuChoiceIndex = 0;
    state->menuAnimOffsetX = 0;
    state->menuType = 0;
    state->menuSelection = 0;

    state->unkAA8 = loadCompressedData(&_459310_ROM_START, &font_main_ROM_START, 0x2278);
