#include "levels/starlight_highway.h"
#include "19E80.h"
#include "42170.h"
#include "56910.h"
#include "5AA90.h"
#include "audio.h"
#include "common.h"
#include "displaylist.h"
#include "gamestate.h"
#include "geometry.h"
#include "rand.h"
#include "task_scheduler.h"

extern s32 gFrameCounter;
extern Gfx *gRegionAllocPtr;
extern s16 gGraphicsMode;

typedef struct {
    u8 _pad[0x80];
    u8 animateNode1;
    u8 animateNode2;
} StarlightBuildingAllocation;

typedef struct {
    DisplayListObject node1;
    DisplayListObject node2;
} StarlightBuildingRenderData;

// Starlight Highway Barrier Task
// Each barrier has two gates (left/right) that open when players enter the trigger sector
typedef struct {
    /* 0x00 */ Transform3D leftGateNode;        // Left gate transform
    /* 0x20 */ void *leftGateDisplayListOffset; // Left gate display list offset
    /* 0x24 */ void *displayListMemory1;        // Display list memory pointer 1
    /* 0x28 */ void *displayListMemory2;        // Display list memory pointer 2
    /* 0x2C */ s32 unk2C;                       // Unknown
    /* 0x30 */ u8 pad30[0xC];
    /* 0x3C */ Transform3D rightGateNode;        // Right gate transform
    /* 0x5C */ void *rightGateDisplayListOffset; // Right gate display list offset
    /* 0x60 */ void *unk60;                      // Unknown
    /* 0x64 */ void *unk64;                      // Unknown
    /* 0x68 */ s32 unk68;                        // Unknown
    /* 0x6C */ u8 pad6C[0xC];
    /* 0x78 */ s32 gateOpenAmount; // Gate opening distance (0 = closed, 0x600000 = fully open)
    /* 0x7C */ u8 barrierIndex;    // Barrier index (0 or 1) to select which configuration to use
} StarlightBarrierTask;

typedef struct {
    u8 _pad[0x24];
    void *displayListMemory1;
    void *displayListMemory2;
    u8 _pad2[0x10];
    void *displayListMemory3;
} DebugDisplayListCleanupState;

typedef struct {
    /* 0x00 */ u8 _pad0[0x20];
    /* 0x20 */ void *config;
    /* 0x24 */ void *displayListMemory1;
    /* 0x28 */ void *displayListMemory2;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ u8 _pad30[0xC];
    /* 0x3C */ void *displayListMemory3;
    /* 0x40 */ u8 _pad40[0x4];
    /* 0x44 */ s16 uOffset;
    /* 0x46 */ s16 vOffset;
    /* 0x48 */ s16 uSpeed;
    /* 0x4A */ s16 vSpeed;
    /* 0x4C */ s16 unk4C;
    /* 0x4E */ u8 _pad4E[0x2];
    /* 0x50 */ s16 animationTimer;
} DebugDisplayListTaskState;

typedef struct {
    u8 unk00[0x20];
    struct {
        s32 unk00;
        s32 renderOpaque;
        s32 renderTransparent;
        s32 renderOverlay;
    } *config;
    u8 unk24[0xC];
    s32 unk30;
    u8 unk34[0x10];
    u16 uOffset;
    u16 vOffset;
    u16 uSpeed;
    u16 vSpeed;
    s32 unk4C;
    s16 animationTimer;
    s16 sustainTimer;
} DebugDisplayListRenderState;

typedef struct {
    u8 pad[0x76];
    u8 paused;
} DebugDisplayListAllocation;

typedef struct {
    /* 0x00 */ Transform3D mat;
    /* 0x20 */ u8 _pad20[0x5C];
} DebugDisplayListPosition;

typedef struct {
    u8 _pad[0x76];
    u8 paused;
} TaskAllocationState;

typedef struct {
    /* 0x00 */ u8 _pad0[0x14];
    /* 0x14 */ Vec3i pos;
    /* 0x20 */ void *displayList;
    /* 0x24 */ void *segment1;
    /* 0x28 */ void *segment2;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ u8 _pad30[0xC];
    /* 0x3C */ Vec3i velocity;
    /* 0x48 */ s16 lifetime;
    /* 0x4A */ u16 rotX;
    /* 0x4C */ u16 rotY;
    /* 0x4E */ u8 type;
} StarlightFireworkTaskState;

typedef struct {
    u8 _pad[0x24];
    void *segment1;
    void *segment2;
} StarlightFireworkCleanupState;

typedef struct {
    s16 rotation[3][3];
    u8 pad2[0xE];
} FireworkInitRotationMatrix;

extern Vec3i D_800BCA30_AEDF0[];
extern s32 gStarlightFireworkPositions[][3];
extern s16 gStarlightFireworkXRotations[];
extern s32 gStarlightFireworkDirections[][3];
extern s16 gStarlightFireworkRotXSpeeds[];
extern s16 gStarlightFireworkRotYSpeeds[];
extern s32 gStarlightBarrierPositionsX[][3];
extern s32 gStarlightBarrierPositionsY[][3];
extern s32 gStarlightBarrierPositionsZ[][3];
extern s16 gStarlightBarrierTriggerSectors[];
extern void *gDebugDisplayConfig;

void cleanupStarlightBarrierTask(DualSegmentCleanupState *);
void cleanupDebugDisplayListTask(DebugDisplayListCleanupState *);
void updateDebugDisplayListGrowth(DebugDisplayListRenderState *);
void renderStarlightHighwayBuildings(StarlightBuildingRenderData *);
void cleanupStarlightHighwayBuildingTask(DualSegmentCleanupState *);
void loadColorIndexedTexture(void *);
void updateStarlightFireworkSimple(StarlightFireworkTaskState *);
void updateStarlightFireworkComplex(StarlightFireworkTaskState *);
void updateStarlightFirework(StarlightFireworkTaskState *);
void cleanupStarlightFireworkTask(StarlightFireworkCleanupState *);
void updateFireworkShowTimer(FireworkShowTimerState *arg0);
void updateStarlightBarrier(StarlightBarrierTask *arg0);

void initStarlightHighwayBuildingTask(StarlightBuildingTaskState *task) {
    task->segment1 = loadUncompressedAssetByIndex(8);
    task->segment2 = loadCompressedSegment2AssetByIndex(8);
    task->unk2C = 0;
    createYRotationMatrix(&task->node1, 0x98A);
    task->node1.translation.x = 0x130F588E;
    task->node1.translation.y = 0x03930000;
    task->node1.translation.z = 0x0DB72F2C;
    task->unk68 = 0;
    task->cleanupSegment1 = task->segment1;
    task->cleanupSegment2 = task->segment2;
    createYRotationMatrix(&task->node2, 0);
    task->node2.translation.x = 0;
    task->node2.translation.y = 0x30000000;
    task->node2.translation.z = 0x30458CB2;
    setCleanupCallback(&cleanupStarlightHighwayBuildingTask);
    setCallback(&renderStarlightHighwayBuildings);
}

void renderStarlightHighwayBuildings(StarlightBuildingRenderData *arg0) {
    StarlightBuildingAllocation *allocation;
    s32 i;
    LevelDisplayLists *displayListResult;

    allocation = (StarlightBuildingAllocation *)getCurrentAllocation();

    if (allocation->animateNode1 != 0) {
        if (gFrameCounter & 1) {
            displayListResult = getSkyDisplayLists3ByIndex(8);
            arg0->node1.displayLists = (DisplayLists *)((u32)displayListResult + 0x10);
        } else {
            displayListResult = getSkyDisplayLists3ByIndex(8);
            arg0->node1.displayLists = (DisplayLists *)((u32)displayListResult + 0x20);
        }
    } else {
        arg0->node1.displayLists = (DisplayLists *)getSkyDisplayLists3ByIndex(8);
    }

    if (allocation->animateNode2 != 0) {
        if (gFrameCounter & 1) {
            displayListResult = getSkyDisplayLists3ByIndex(8);
            arg0->node2.displayLists = (DisplayLists *)((u32)displayListResult + 0x10);
        } else {
            displayListResult = getSkyDisplayLists3ByIndex(8);
            arg0->node2.displayLists = (DisplayLists *)((u32)displayListResult + 0x20);
        }
    } else {
        arg0->node2.displayLists = (DisplayLists *)getSkyDisplayLists3ByIndex(8);
    }

    for (i = 0; i < 4; i++) {
        enqueueDisplayListWithFrustumCull(i, &arg0->node1);
        enqueueDisplayListWithFrustumCull(i, &arg0->node2);
    }
}

void cleanupStarlightHighwayBuildingTask(DualSegmentCleanupState *arg0) {
    arg0->segment1 = freeNodeMemory(arg0->segment1);
    arg0->segment2 = freeNodeMemory(arg0->segment2);
}

void initDebugDisplayListTask(DebugDisplayListTaskState *arg0) {
    arg0->displayListMemory1 = loadUncompressedAssetByIndex(8);
    arg0->displayListMemory2 = loadCompressedSegment2AssetByIndex(8);
    arg0->unk2C = 0;
    arg0->displayListMemory3 = loadSpriteAssetByIndex(8);
    arg0->config = &gDebugDisplayConfig;
    arg0->unk4C = 0;
    arg0->uSpeed = 8;
    arg0->vSpeed = 0;
    arg0->uOffset = 0;
    arg0->vOffset = 0;
    arg0->animationTimer = 0;
    setCleanupCallback(&cleanupDebugDisplayListTask);
    setCallback(&updateDebugDisplayListGrowth);
}

void renderColorIndexedOpaqueDisplayList(void *);
void renderColorIndexedTransparentDisplayList(void *);
void renderColorIndexedOverlayDisplayList(void *);
void renderDebugDisplayLists(DebugDisplayListRenderState *arg0);
void updateDebugDisplayListSustain(DebugDisplayListRenderState *arg0);
void updateDebugDisplayListDecay(DebugDisplayListRenderState *arg0);

void renderDebugDisplayLists(DebugDisplayListRenderState *arg0) {
    s32 i;

    arg0->uOffset += arg0->uSpeed;
    arg0->vOffset = arg0->vOffset + arg0->vSpeed;
    arg0->unk30 = 0;
    arg0->uOffset = arg0->uOffset & 0xFF;
    arg0->vOffset = arg0->vOffset & 0xFF;
    ;

    for (i = 0; i < 4; i++) {
        if (arg0->config->renderOpaque != 0) {
            debugEnqueueCallback(i & 0xFFFF, 1, renderColorIndexedOpaqueDisplayList, arg0);
        }

        if (arg0->config->renderTransparent != 0) {
            debugEnqueueCallback(i & 0xFFFF, 3, renderColorIndexedTransparentDisplayList, arg0);
        }

        if (arg0->config->renderOverlay == 0) {
            continue;
        }

        debugEnqueueCallback(i & 0xFFFF, 5, renderColorIndexedOverlayDisplayList, arg0);
    }
}

void updateDebugDisplayListGrowth(DebugDisplayListRenderState *arg0) {
    DebugDisplayListAllocation *allocation = getCurrentAllocation();

    if (allocation->paused == 0) {
        arg0->animationTimer += 0x10;
    }

    if (arg0->animationTimer == 0xC0) {
        setCallback(&updateDebugDisplayListSustain);
        arg0->sustainTimer = 0x40;
    }

    renderDebugDisplayLists(arg0);
}

void updateDebugDisplayListSustain(DebugDisplayListRenderState *arg0) {
    DebugDisplayListAllocation *allocation = getCurrentAllocation();

    if (allocation->paused == 0) {
        arg0->sustainTimer--;
    }

    if (arg0->sustainTimer == 0) {
        setCallback(&updateDebugDisplayListDecay);
    }

    renderDebugDisplayLists(arg0);
}

void updateDebugDisplayListDecay(DebugDisplayListRenderState *arg0) {
    DebugDisplayListAllocation *allocation = getCurrentAllocation();

    if (allocation->paused == 0) {
        arg0->animationTimer -= 0x10;
    }

    if (arg0->animationTimer == 0) {
        terminateCurrentTask();
    }

    renderDebugDisplayLists(arg0);
}

void cleanupDebugDisplayListTask(DebugDisplayListCleanupState *arg0) {
    arg0->displayListMemory1 = freeNodeMemory(arg0->displayListMemory1);
    arg0->displayListMemory2 = freeNodeMemory(arg0->displayListMemory2);
    arg0->displayListMemory3 = freeNodeMemory(arg0->displayListMemory3);
}

typedef struct {
    /* 0x00 */ u8 _pad0[0x3C];
    /* 0x3C */ DataTable_19E80 *textureTable;
    /* 0x40 */ u8 _pad40[4];
    /* 0x44 */ u16 tileULow;
    /* 0x46 */ u16 tileVLow;
    /* 0x48 */ u8 _pad48[4];
    /* 0x4C */ u16 textureIndex;
    /* 0x4E */ u8 _pad4E[3];
    /* 0x51 */ u8 alpha;
} TextureRenderState;

void loadColorIndexedTexture(void *arg) {
    TextureRenderState *state = (TextureRenderState *)arg;
    OutputStruct_19E80 tableEntry;
    s32 dxtBase;
    s32 lrs;
    u16 widthDiv16;
    Gfx *loadBlockCmd;
    long loadBlockWord;
    s32 loadTileParams;
    s32 widthShift;
    s32 heightShift;
    s32 tempWidth;
    s32 tempHeight;
    u32 tileLine;

    gDPPipeSync(gRegionAllocPtr++);
    gDPSetTextureLUT(gRegionAllocPtr++, G_TT_RGBA16);
    gGraphicsMode = -1;

    getTableEntryByU16Index(state->textureTable, state->textureIndex, &tableEntry);

    tempWidth = tableEntry.field1;
    widthShift = 0;
loop_1:
    if (!(tempWidth & 1)) {
        do {
            widthShift += 1;
            if (widthShift < 0x10) {
                tempWidth >>= 1;
                goto loop_1;
            }
        } while (0);
    }

    tempHeight = tableEntry.field2;
    heightShift = 0;
loop_2:
    if (!(tempHeight & 1)) {
        do {
