#include "race/track_geometry.h"
#include "D_800AFE8C_A71FC_type.h"
#include "animation/easing_state.h"
#include "audio/audio.h"
#include "common.h"
#include "gamestate.h"
#include "math/geometry.h"
#include "math/rand.h"
#include "story/npc_dialogue.h"
#include "story/rare_event_npcs.h"
#include "system/task_scheduler.h"
#include "ui/level_preview_3d.h"

typedef struct {
    s32 unk0;
    Transform3D unk4;
    /* 0x24 */ u8 pad2[0x8];
    /* 0x2C */ u16 unk2C;
    /* 0x2E */ u16 unk2E;
    /* 0x30 */ u8 pad3[0x10];
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ u8 pad3b[0x8];
    /* 0x50 */ s16 unk50;
    /* 0x52 */ s16 unk52;
    /* 0x54 */ u8 pad4[0x8];
    /* 0x5C */ u8 unk5C;
    /* 0x5D */ u8 pad5[0x5];
    /* 0x62 */ s8 unk62;
    /* 0x63 */ s8 unk63;
} Func8002CB88Arg_arg0;

typedef struct RareEventIdleState RareEventIdleState;
struct RareEventIdleState {
    /* 0x00 */ Func8002CB88Arg_arg0 elements[2];
    /* 0xC8 */ void (*callback)(RareEventIdleState *);
    /* 0xCC */ u16 effectDelay[1];
    /* 0xCE */ u16 effectDuration;
    /* 0xD0 */ u8 pad9[0x5];
    /* 0xD5 */ u8 npcCount;
};

extern u16 D_8009ADE0_9B9E0;

typedef struct Func8002CD3CArg Func8002CD3CArg;
struct Func8002CD3CArg {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ u8 pad0[0x14];
    /* 0x18 */ s32 unk18;
    /* 0x1C */ u8 pad1[0x4];
    /* 0x20 */ s32 unk20;
    /* 0x24 */ u8 pad2[0x1C];
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ u8 pad3[0x8];
    /* 0x50 */ s16 unk50;
    /* 0x52 */ u8 pad3b[0x10];
    /* 0x62 */ s8 unk62;
    /* 0x63 */ u8 pad5[0x1];
    /* 0x64 */ s32 unk64;
    /* 0x68 */ u8 pad6[0x3C];
    /* 0xA4 */ s32 unkA4;
    /* 0xA8 */ u8 pad7[0x20];
    /* 0xC8 */ void (*unkC8)(Func8002CD3CArg *);
    /* 0xCC */ u16 unkCC;
    /* 0xCE */ u16 unkCE;
    /* 0xD0 */ u8 pad12[0x5];
    /* 0xD5 */ u8 unkD5;
};

extern u16 gNpcCollisionRadii[];

void updateStoryMapRareEventIdle(RareEventIdleState *);
void updateStoryMapRareEventWave(RareEventIdleState *);
void updateStoryMapRareEventJuggling(Func2E024Arg *arg0);
void updateStoryMapRareEventSledding(Func2E024Arg *);
void updateStoryMapRareEventSkating(Func2E024Arg *);

void initStoryMapRareEventWave(Func2E024Arg *arg0) {
    GameState *allocation;
    s32 vec3[3];
    s32 i;
    Func297D8Arg *elements;

    allocation = getCurrentAllocation();
    vec3[2] = 0;
    vec3[0] = 0;
    vec3[1] = 0x2C0000;

    elements = arg0->elements;
    for (i = 0; i < arg0->unkD5; i++) {
        memcpy(&elements[i].matrix, &identityMatrix, sizeof(Transform3D));
        elements[i].unk62 = 0;

        if (i == 0) {
            arg0->elements[0].matrix.translation.x = -0x60000;
            arg0->elements[0].matrix.translation.z = -0x4A0000;
            setAnimationIndex(arg0->elements[0].model, 1);
        } else {
