#include "graphics/displaylist.h"

#include "assets.h"
#include "common.h"
#include "data/data_table.h"
#include "gbi.h"
#include "graphics/graphics.h"
#include "gu.h"
#include "math/geometry.h"
#include "mbi.h"
#include "race/race_session.h"
#include "system/rom_loader.h"
#include "system/task_scheduler.h"
#include "text/font_assets.h"

USE_OVERLAY(rand);

typedef struct {
    /* 0x00 */ s32 vertices;
    /* 0x04 */ s32 posX;
    /* 0x08 */ s32 posY;
    /* 0x0C */ s32 posZ;
    /* 0x10 */ u8 *textureData;
    /* 0x14 */ u8 *paletteData;
    /* 0x18 */ u8 width;
    /* 0x19 */ u8 height;
    /* 0x1A */ u8 padding[2];
    /* 0x1C */ Mtx *matrix;
} TexturedSpriteState;

typedef struct {
    /* 0x00 */ s32 vertices;
    /* 0x04 */ s16 rotation[3][3];
    /* 0x16 */ u16 padding;
    /* 0x18 */ s32 posX;
    /* 0x1C */ s32 posY;
    /* 0x20 */ s32 posZ;
    /* 0x24 */ u8 *textureData;
    /* 0x28 */ u8 *paletteData;
    /* 0x2C */ u8 width;
    /* 0x2D */ u8 height;
    /* 0x2E */ u8 padding2[2];
    /* 0x30 */ Mtx *matrix;
} RotatedBillboardSprite;

typedef struct {
    /* 0x00 */ s32 vertices;
    /* 0x04 */ s32 posX;
    /* 0x08 */ s32 posY;
    /* 0x0C */ s32 posZ;
    /* 0x10 */ u8 *textureData;
    /* 0x14 */ u8 *paletteData;
    /* 0x18 */ u8 width;
    /* 0x19 */ u8 height;
    /* 0x1A */ u8 alpha;
    /* 0x1B */ u8 padding;
    /* 0x1C */ Mtx *matrix;
} AlphaSpriteState;

typedef struct {
    DataTable_19E80 *fontDataTable;
} FontSystemInitData;

extern s32 gLookAtPtr;
extern ActiveViewportOverlay *gActiveViewport;
extern Gfx *gDisplayListAllocPtr;
extern s16 gGraphicsMode;
extern void *D_800A2D40_A3940;
extern void *D_800A2D44_A3944;
extern void *D_800A2D48_A3948;
extern Gfx D_8009A780_9B380[];
extern u32 D_800A2D4C_A394C;
extern u32 D_800A2D50_A3950;
extern u8 D_800A2D54_A3954;

Gfx gAlphaSpriteSetupDL[] = {
    gsSPClearGeometryMode(
        G_ZBUFFER | G_SHADE | G_CULL_BOTH | G_FOG | G_LIGHTING | G_TEXTURE_GEN | G_TEXTURE_GEN_LINEAR | G_SHADING_SMOOTH
    ),
    gsSPSetGeometryMode(G_ZBUFFER | G_SHADE | G_CULL_BACK | G_FOG | G_SHADING_SMOOTH),
    gsSPTexture(0x8000, 0x8000, 0, G_TX_RENDERTILE, G_ON),
    gsDPPipeSync(),
    gsDPSetTextureFilter(G_TF_BILERP),
    gsDPSetCycleType(G_CYC_2CYCLE),
