#include "audio/audio.h"
#include "assets.h"
#include "common.h"
#include "math/geometry.h"
#include "os_message.h"
#include "os_pi.h"
#include "os_thread.h"
#include "race/player.h"
#include "system/memory_allocator.h"
#include "system/task_scheduler.h"

typedef struct {
    void *musicBankBuffer;
    void *ptrBank;
    void *waveBank;
    s32 soundId;
    s32 soundSequence;
    s32 volume;
    s32 pan;
    void *audioChannel;
    s32 stoppingSpeed;
    f32 position;
    s32 voiceIndex;
    s32 unk2C;
    s32 unk30;
} GraphicsCommand;
extern GraphicsCommand gGraphicsCommand;

typedef struct {
    s16 soundId;
    s16 duration;
    s16 priority;
    s16 hasVolume;
    f32 volume;
    Vec3i position;
    s16 flags;
    u8 padding[2];
} RenderQueueItem;

typedef struct {
    /* 0x00 */ void *ptrBank;
    /* 0x04 */ void *musicDataBuffer;
    /* 0x08 */ void *musicBankBuffer;
    /* 0x0C */ void *currentAudioChannel;
    /* 0x10 */ s16 pendingMusicId;
    /* 0x12 */ u16 currentMusicId;
    /* 0x14 */ s16 musicFadeOutDuration;
    /* 0x16 */ s16 currentMusicVolume;
    /* 0x18 */ s16 targetMusicVolume;
    /* 0x1A */ s16 fadeCounter;
    /* 0x1C */ s8 musicVoiceIndex;
    /* 0x1D */ u8 musicFadeState;
    /* 0x1E */ u8 isFadingOut;
    /* 0x1F */ u8 unk1F;
    /* 0x20 */ s32 soundSequence;
    /* 0x24 */ void *soundEffectChannels[0xF];
    /* 0x60 */ s32 padding3;
    /* 0x64 */ s16 soundEffectIds[0x10];
    /* 0x84 */ s32 renderQueueCount;
    /* 0x88 */ RenderQueueItem renderQueue[32];
    /* 0x408 */ s32 bufferCount;
    /* 0x40C */ u8 bufferData[8][0x20];
    /* 0x50C */ s8 bufferIds[0x8];
    /* 0x514 */ s32 bufferFlags[8];
    /* 0x534 */ s32 audioInnerDistance;
    /* 0x538 */ s32 audioOuterDistance;
} GraphicsManager;
extern GraphicsManager *gGraphicsManager;

extern OSMesgQueue gfxTaskQueue;
extern OSMesgQueue gfxResultQueue;

extern OSMesg gfxTaskQueueBuffer;
extern OSMesg gfxResultQueueBuffer;
extern OSThread gfxCommThread;

void func_8005628C_56E8C(void);

void *startSoundEffect(s32, s32, s32, s32, s32);
s32 countChannelsByHandle(u32 handle);
void *startSongWithSingleFxBank(void *, void *);

typedef struct {
    void *start;
    void *end;
    s32 size;
} GraphicsDataSegment;

USE_ASSET(_6B6410)

u32 D_800915D0_921D0[1] = { 0x80000000 };
u32 D_800915D4_921D4[5] = { 0x81258401, 0x01017FFF, 0x7F019C7F, 0xA66424FF, 0xFF800000 };
u32 D_800915E8_921E8[5] = { 0x81268401, 0x01017FFF, 0x7F019C7F, 0xA66424FF, 0xFF800000 };
u32 D_800915FC_921FC[5] = { 0x81008401, 0x01017FFF, 0x7F019C7F, 0xA66430FF, 0xFF800000 };
u32 D_80091610_92210[5] = { 0x81018401, 0x01017FFF, 0x7F019C7F, 0xA66430FF, 0xFF800000 };
