#include "19E80.h"
#include "413E0.h"
#include "51060.h"
#include "56910.h"
#include "594E0.h"
#include "5AA90.h"
#include "5E590.h"
#include "6E840.h"
#include "common.h"
#include "course.h"
#include "displaylist.h"
#include "gamestate.h"
#include "gbi.h"
#include "geometry.h"
#include "graphics.h"
#include "levels/haunted_house.h"
#include "levels/ice_land.h"
#include "levels/jingle_town.h"
#include "levels/lindas_castle.h"
#include "levels/snowboard_street_shoot_cross.h"
#include "levels/starlight_highway.h"
#include "levels/sunny_mountain.h"
#include "levels/wendys_house.h"
#include "race_session.h"
#include "rand.h"
#include "rom_loader.h"
#include "task_scheduler.h"

USE_ASSET(_3F6670);
USE_ASSET(_3F6950);
USE_ASSET(_3F3EF0);

typedef struct {
    void *assetTable;
    loadAssetMetadata_arg metadata;
    u8 _pad20[0x4];
    s32 velX;
    s32 velY;
    s32 velZ;
    Player *player;
    u16 sectorIndex;
    u8 _pad36[0x2];
    s16 playerIndex;
    s16 initFlag;
} PanelProjectileInitArg;

typedef struct {
    u8 _pad0[0x4];
    u8 metadataPad[0x4];
    Vec3i position;
    u8 _pad14[0x10];
    s32 velX;
    s32 velY;
    s32 velZ;
    u8 _pad30[0x4];
    u16 sectorIndex;
    s16 timer;
    s16 playerIndex;
    s16 initFlag;
} PanelProjectileUpdateArg;

typedef struct {
    u8 _pad0[0x4];
    func_80066444_67044_arg1 metadata;
} PanelProjectileImpactArg;

typedef struct {
    u8 padding[0x5B];
    u8 availableHomingProjectileSlots;
    u8 padding2[0x1A];
    u8 unk76;
} allocation_46080;

typedef struct {
    void *assetData;
    void *metadataPtr;
    s32 posX;
    s32 posY;
    s32 posZ;
    u8 _pad14[0x10];
    s32 velX;
    s32 velY;
    s32 velZ;
    u16 sectorIndex;
    u8 _pad32[0x2];
    s16 impactTimer;
    s16 targetPlayerIndex;
    s16 targetVariant;
} ItemHomingProjectileMoveArg;

typedef struct {
    void *assetData;
    void *metadataPtr;
    u8 _pad[0x28];
    s16 sectorIndex;
    u8 _pad2[0x2];
    s16 impactTimer;
    s16 targetPlayerIndex;
    s16 targetVariant;
} ItemHomingProjectileImpactArg;

typedef struct {
    void *projectileAsset;
} BossHomingProjectileTask;

typedef struct {
    void *projectileAsset;
} BossHomingProjectileCleanupArg;

typedef struct {
    u8 _pad0[0x4];
    u8 metadata[0x4];
    Vec3i position;
    u8 _pad14[0x14];
    s32 velocityX;
    s32 velocityY;
    s32 velocityZ;
    u16 sectorIndex;
    s16 bounceTimer;
    s16 playerIndex;
} BossHomingProjectile;

typedef struct {
    u8 _pad0[0x4];
    func_80066444_67044_arg1 displayListState;
} BossHomingProjectileBounceArg;

typedef struct {
    u8 pad[0x24];
    void *player;
} BossHomingProjectileSpawnTask;

typedef struct {
    void *unk0;
} func_8004BC20_4C820_arg;

typedef struct {
    u8 pad[0x24];
    Player *unk24;
} func_8004BC5C_4C85C_Task;

typedef struct {
    u8 _pad0[0x4];
    u8 unk4[0x4];
    Vec3i unk8;
    u8 _pad14[0x14];
    s32 unk28;
    s32 unk2C;
    s32 unk30;
    u16 unk34;
    s16 unk36;
    s16 unk38;
} func_8004BE40_4CA40_arg;

typedef struct {
    u8 _pad0[0x4];
    func_80066444_67044_arg1 unk4;
    s16 unk38;
} func_8004BFBC_4CBBC_arg;

typedef struct {
    void *assetData;
    loadAssetMetadata_arg metadata;
    u8 _pad[0x4];
    u16 animationCounter;
    u8 _pad2[0x2];
    s32 velocity;
} PlayerSparkleTask;

typedef struct {
    u8 padding0[0x8];
    Vec3i pos;         /* 0x8 - Position (x, y, z) - 12 bytes */
    u8 padding2[0x10]; /* 0x14 - Padding (16 bytes) to reach 0x24 */
    s16 playerIndex;   /* 0x24 - Player index (unkB94) - 2 bytes */
    s16 padding26;     /* 0x26 - Padding (2 bytes) */
    s32 timer;         /* 0x28 - Impact timer (4 bytes) */
    Vec3i vel;         /* 0x2C - Velocity (x, y, z) - 12 bytes */
} HomingProjectileTask;

typedef struct {
    u8 _pad[0x3C];
    s32 playerIndex;
} PlayerRenderTask;

typedef struct {
    void *assetData;
    void *metadataPtr;
    u8 _pad[0x1C];
    s32 velOffsetX;
    s32 velOffsetY;
    s32 velOffsetZ;
    u8 _pad2[0x2];
    s16 animFrame;
    u8 _pad3[0x2];
    s16 targetPlayerIndex;
    s16 targetVariant;
} ItemHomingProjectileInitArg;

typedef struct {
    u8 _pad0[0x4C];
    s32 unk4C;
    s32 unk50;
    s32 unk54;
    u8 _pad58[0x3F4];
    s32 velocity;
    s32 unk450;
    s32 unk454;
    u8 _pad458[0x63C];
    u16 unkA94;
    u8 _padA96[0xFE];
    u16 unkB94;
    u8 _padB96[0x22];
    u8 unkBB8;
} BossEntity;

typedef struct {
    void *projectileAsset;
    void *unk4;
    Vec3i position;
    u8 _pad14[0x10];
    BossEntity *boss;
    Vec3i velocity;
    s16 sectorIndex;
    s16 bounceTimer;
    s16 playerIndex;
} BossHomingProjectileSpawnArg;

typedef struct {
    s16 unk0;
    u8 _pad2[0x4];
    u16 unk6;
    u8 unk8[0xC];
} SceneAnimationEntryNew;

typedef struct {
    void *transformBuffer;
    void *headerData;
    SceneAnimationEntryNew *entries;
    void *assetData;
    void *loadedData;
    s16 assetIndex;
    s16 dataIndex;
    s16 entryCount;
    s16 unk1A;
    s32 frameCounter;
} SceneAnimationTaskNew;

typedef struct {
    u8 _pad0[0x4];
    func_80066444_67044_arg1 unk4;
    s16 unk38;
} func_8004BB0C_4C70C_arg;

typedef struct {
    s32 unk0;
    func_80066444_67044_arg1 unk4;
    s16 unk38;
} func_8004B990_4C590_arg;

typedef struct {
    void *unk0;
} func_8004C0D0_4CCD0_arg;

typedef struct {
    void *assetData; /* 0x0 - Asset data pointer */
    void *metadata;  /* 0x4 - Asset metadata pointer */
    s32 posX;        /* 0x8 - X position */
    s32 posY;        /* 0xC - Y position */
    s32 posZ;        /* 0x10 - Z position */
    u8 _pad14[0x10];
    u16 sectorIndex; /* 0x24 - Course sector index */
    u16 animFrame;   /* 0x26 - Animation frame */
    s16 timer;       /* 0x28 - Impact timer */
    u8 _pad2A[0x2];
    s32 velX; /* 0x2C - X velocity */
    s32 velY; /* 0x30 - Y velocity */
    s32 velZ; /* 0x34 - Z velocity */
} HomingProjectileUpdateArg;

typedef struct {
    DataTable_19E80 *assetTable;
    OutputStruct_19E80 textureEntry;
    Transform3D transform;
    Mtx *transformMatrix;
    GameStateUnk44Unk2C0 *renderEntry;
    s32 frameIndex;
    s32 isSecondaryBox;
} ItemBoxBurstEffectState;

typedef struct {
    void *unk0;
} func_8004B264_4BE64_arg;

typedef struct {
    u8 _pad[0x24];
    void *unk24;
    void *unk28;
} SkyRenderTaskCleanupArg;

typedef struct {
    u8 _pad[0xB4];
    s16 skyType;
} ScheduledTask;

typedef struct {
    u8 _pad0[0x20];
    s32 unk20;
    void *unk24;
    void *unk28;
    s32 unk2C;
    u8 _pad30[0xC];
    u8 unk3C[0x20];
    s32 unk5C;
    void *unk60;
    void *unk64;
    s32 unk68;
    u8 _pad6C[0xC];
    u8 unk78[0x20];
    void *unk98;
    void *unk9C;
    void *unkA0;
    s32 unkA4;
    u8 _padA8[0xC];
    s16 skyType;
} SkyRenderTaskState;

typedef struct {
    u8 _pad[0x30];
    u8 unk30[0x2C];
    u8 unk5C;
    u8 _pad5D[0x19];
    u8 unk76;
} GameState_46080;

typedef struct {
    u8 _pad[0x14];
    Vec3i position;
    void *unk20;
    void *unk24;
    void *unk28;
    void *unk2C;
    u8 _pad3[0x10];
    s32 unk40;
} PlayerRenderTaskState;

typedef struct {
    u8 _pad[0x24];
    void *unk24;
    void *unk28;
} PlayerRenderTaskCleanupArg;

typedef struct {
    u8 _pad[0x20];
    DisplayLists *displayLists;
    u8 _pad2[0x3C - 0x24];
    s32 playerIndex;
    s32 pendingSyncFrames;
} PlayerDisplayListState;

typedef struct {
    s16 unk0;
    u8 _pad2[0x6];
    u8 unk8[0xC];
} SceneAnimationEntry;

typedef struct {
    void *transformBuffer;
    void *headerData;
    SceneAnimationEntry *volatile entries;
    void *assetData;
    void *loadedData;
    s16 assetIndex;
    s16 dataIndex;
    s16 entryCount;
} SceneAnimationTask;

typedef union {
    s16 halfword;
    struct {
        u8 high;
        u8 low;
    } bytes;
} HalfwordBytes;

typedef struct {
    void *unk0;
    void *opaqueDisplayList;
    void *transparentDisplayList;
    void *overlayDisplayList;
} SceneryDisplayLists;

typedef struct {
    u8 _pad[0x20];
    SceneryDisplayLists *displayLists;
    u8 _pad2[0xC];
    s32 unk30;
    u8 _pad3[0x10];
    HalfwordBytes scrollX;
    HalfwordBytes scrollY;
    s16 unk48;
    s16 scrollSpeedX;
    s16 scrollSpeedY;
} ScrollingSceneryTaskState;

typedef struct {
    u8 _pad[0x24];
    void *unk24;
    void *unk28;
    void *unk2C;
    u8 _pad2[0xC];
    void *unk3C;
    u8 _pad3[0x4];
    HalfwordBytes scrollX;
    HalfwordBytes scrollY;
    s16 assetPoolIndex;
} ScrollingSceneryCleanupState;

typedef struct {
    u8 _pad[0x76];
    u8 unk76;
    u8 _pad2[2];
    u8 unk79;
} Allocation_47D1C;

typedef struct {
    DisplayListObject displayListObject;
    s32 frameCounter;
    s32 rotationAngle;
} FlyingSceneryState;

typedef struct {
    u8 unk0[0x14];
    s32 unk14;
    s32 unk18;
    s32 unk1C;
    void *unk20;
    void *unk24;
    void *unk28;
    void *unk2C;
    u8 _pad2[0xC];
    u8 unk3C[0x14];
    s32 unk50;
    s32 unk54;
    s32 unk58;
    void *unk5C;
    u8 _pad3[0x18];
    u8 unk78[0x18];
    s32 unk90;
    u8 _pad4[4];
    void *unk98;
} CourseSceneryTaskState;

typedef struct {
    u8 _pad[0x3C];
    u8 unk3C[0x3C];
    u8 unk78[0x3C];
    s16 rotationAngle;
} CourseSceneryUpdateState;

typedef struct {
    u8 _pad[0x20];
    void *displayLists;
    u8 _pad2[0x24];
    s16 assetPoolIndex;
    s16 scrollSpeedX;
    s16 scrollSpeedY;
    s16 unk4E;
    s16 unk50;
} ScrollingSceneryTask;

typedef struct {
    u8 _pad[0x24];
    void *unk24;
    void *unk28;
} CourseSceneryCleanupArg;

typedef struct {
    s8 visible;
    u8 _pad1[0x3];
    u8 positionData[0xC];
} GoldCoinEntry;

typedef struct {
    void *matrixBuffer;
    void *displayData;
    GoldCoinEntry *entries;
    u8 _padC[0x4];
    s32 *compressedData;
    u8 _pad14[0x2];
    s16 coinCount;
    s16 animationFrame;
} GoldCoinSetupState;

typedef struct {
    void *unk0;
    u8 _pad[0x8];
    void *unkC;
    void *unk10;
    s16 courseIndex;
} GoldCoinsTaskState;

typedef struct {
    u8 _pad0[0x76];
    u8 unk76;
} AllocationData;

typedef struct {
    void *assetData;
} PlayerAuraCleanupState;

typedef struct {
    void *assetData;
} PlayerAuraTask;

typedef struct {
    u8 _pad0[0x44];
    s32 unk44;
} AllocationType_46080;

typedef struct {
    loadAssetMetadata_arg asset;
    u8 _pad1C[0x4];
} AssetMetadata_46080;

typedef struct {
    s32 unk0;
    s32 unk4;
    s32 posX;
    s32 posY;
    s32 posZ;
    u8 _pad14[0xC];
} PlayerAuraElement;

typedef struct {
    void *assetData;
    AssetMetadata_46080 element0;
    AssetMetadata_46080 element1;
    AssetMetadata_46080 element2;
    Player *player;
    s16 holdTimer;
    s16 animationAngle;
} PlayerAuraState;

typedef struct {
    s8 visible;
    s8 processed;
    s16 respawnTimer;
    Vec3i position;
} GoldCoinRenderEntry;

typedef struct {
    void *matrixBuffer;
    void *displayData;
    GoldCoinRenderEntry *entries;
    DataTable_19E80 *textureTable;
    s32 unk10;
    s16 unk14;
    s16 coinCount;
    u16 animationFrame;
} GoldCoinRenderState;

typedef struct {
    Node n;
    s32 unk2C;
    s32 unk30;
    s32 padding[2];
    s32 unk3C;
} NodeWithPayload;

typedef struct {
    u8 _pad[0x14];
    s16 courseId;
} ItemBoxSystemTaskParams;

typedef struct {
    Transform3D matrix;
    u8 padding[0x1C];
    DisplayListObject displayList;
    s32 baseY;
    s16 rotationAngle;
    s16 stateTimer;
    s8 state;
    s8 isSecondaryItemBox;
    u8 padding4[0x2];
} ItemBox;

typedef struct {
    u8 _pad[0x8];
    ItemBox *itemBoxes;
    u8 _pad2[0xA];
    s16 itemBoxCount;
} ItemBoxController;

typedef struct {
    u8 padding[0x18];
    u8 unk18;
    u8 _pad[0x7];
    u8 unk20;
} SecondaryItemDropElement;

typedef struct {
    s16 unk0;
    u8 _pad[14];
} ItemBoxPositionEntry;

typedef struct {
    s32 offset;
} ItemBoxPositionBlock;

typedef struct {
    void *asset1;
    void *asset2;
    void *itemBoxMemory;
    ItemBoxPositionBlock *positionData;
    ItemBoxPositionEntry *positionEntries;
    s16 courseId;
    s16 itemBoxCount;
    u8 secondaryDropMode;
    u8 _pad3[0x3];
    u8 primaryDropMode;
    u8 _pad4[0x3];
    u8 secondaryDropSeed;
    u8 _pad5[0x3];
    u8 primaryDropSeed;
} ItemBoxSystemState;

typedef struct {
    u8 padding[0xA4];
    Player *player;
} PlayerHaloTaskParams;

typedef struct {
    s32 unk0;
    s32 unk4;
    s32 posX;
    s32 posY;
    s32 posZ;
    u8 _pad14[0xC];
} PlayerHaloElement;

typedef struct {
    void *assetData;
} PlayerHaloTask;

typedef struct {
    u8 padding[0x64];
    void *player;
} PlayerAuraTaskParams;

typedef struct {
    u8 _pad0[0x44];
    s32 displayListBase;
} GoldCoinAllocation;

typedef struct {
    u8 _pad[0xC];
    s32 unkC;
    s32 unk10;
    s32 unk14;
    u8 _pad2[0x44];
    u8 unk5C;
} AllocationStruct;

typedef struct {
    void *assetData;
    AssetMetadata_46080 elements[5];
    Player *player;
    s16 frameTimer;
    u16 animationIndex;
    s16 animationAngle;
} PlayerHaloState;

typedef struct {
    void *assetData;                /* 0x0 - Asset data pointer */
    loadAssetMetadata_arg metadata; /* 0x4 - Asset metadata (28 bytes) */
    u8 _pad20[0x6];                 /* 0x20 - Padding to reach 0x26 */
    s16 animFrame;                  /* 0x26 - Animation frame */
    s16 timer;                      /* 0x28 - Impact timer */
} HomingProjectileImpactArg;

/* Note: HomingProjectileUpdateArg uses individual fields to maintain exact memory layout */

typedef struct {
    void *assetData;   /* 0x0 - Asset data pointer */
    void *metadataPtr; /* 0x4 - Metadata pointer */
    u8 _pad[0x1E];
    s16 animFrame; /* 0x26 - Animation frame */
    u8 _pad2[0x4];
    s32 velX; /* 0x2C - X velocity */
    s32 velY; /* 0x30 - Y velocity */
    s32 velZ; /* 0x34 - Z velocity */
} HomingProjectileInitArg;

typedef struct {
    void *matrixBuffer;
    void *displayData;
    GoldCoinRenderEntry *entries;
    u8 _padC[0x4];
    s32 *compressedData;
    u8 _pad14[0x2];
    s16 coinCount;
    u16 animationFrame;
} GoldCoinUpdateState;

typedef struct {
    void *romStart;
    void *romEnd;
    s32 decompressedSize;
} CompressedAsset;

extern s8 D_80090C94_91894[];
extern u8 D_80090C95_91895[];
extern void *D_80094DA0_959A0;
extern void *D_80094DE0_959E0;
extern void *D_80094DF0_959F0;
extern void *D_80094E00_95A00;
extern void *D_80094E10_95A10;
extern void *D_80094EE0_95AE0;
extern void *D_80094EF0_95AF0;
extern void *D_80094FC0_95BC0;
extern void *D_80094FD0_95BD0;
extern void *D_800950B0_95CB0;
extern void *D_80095360_95F60;
extern void *D_80095370_95F70;
extern void *D_80095380_95F80;
extern void *D_80095460_96060;
extern void *D_80095470_96070;
extern void *D_80095480_96080;
extern void *D_800955C0_961C0;
