#include "displaylist.h"

#include "19E80.h"
#include "5AA90.h"
#include "68CF0.h"
#include "assets.h"
#include "common.h"
#include "gamestate.h"
#include "gbi.h"
#include "geometry.h"
#include "graphics.h"
#include "race_session.h"
#include "rom_loader.h"
#include "task_scheduler.h"

USE_OVERLAY(rand);

typedef struct {
    u8 padding[0x120];
    s32 cameraRotationMatrix;
    u8 padding2[0x10];
    s32 cameraX;
    s32 cameraY;
    s32 cameraZ;
    u8 padding3[0x8];
    u8 defaultLight1R;
    u8 defaultLight1G;
    u8 defaultLight1B;
    u8 padding4[0xD];
    u8 defaultLight2R;
    u8 defaultLight2G;
    u8 defaultLight2B;
} gActiveViewport_arg;

typedef struct {
    /* 0x00 */ s32 vertices;
    /* 0x04 */ s32 posX;
    /* 0x08 */ s32 posY;
    /* 0x0C */ s32 posZ;
    /* 0x10 */ u8 *textureData;
    /* 0x14 */ u8 *paletteData;
    /* 0x18 */ u8 width;
    /* 0x19 */ u8 height;
    /* 0x1A */ u8 padding[2];
    /* 0x1C */ Mtx *matrix;
} TexturedSpriteState;

typedef struct {
    /* 0x00 */ s32 vertices;
    /* 0x04 */ s16 rotation[3][3];
    /* 0x16 */ u16 padding;
    /* 0x18 */ s32 posX;
    /* 0x1C */ s32 posY;
    /* 0x20 */ s32 posZ;
    /* 0x24 */ u8 *textureData;
    /* 0x28 */ u8 *paletteData;
    /* 0x2C */ u8 width;
    /* 0x2D */ u8 height;
    /* 0x2E */ u8 padding2[2];
    /* 0x30 */ Mtx *matrix;
} RotatedBillboardSprite;

typedef struct {
    /* 0x00 */ s32 vertices;
    /* 0x04 */ s32 posX;
    /* 0x08 */ s32 posY;
    /* 0x0C */ s32 posZ;
    /* 0x10 */ u8 *textureData;
    /* 0x14 */ u8 *paletteData;
    /* 0x18 */ u8 width;
    /* 0x19 */ u8 height;
    /* 0x1A */ u8 alpha;
    /* 0x1B */ u8 padding;
    /* 0x1C */ Mtx *matrix;
} AlphaSpriteState;

extern s32 gLookAtPtr;
extern gActiveViewport_arg *gActiveViewport;
extern Gfx *gRegionAllocPtr;
extern s16 gGraphicsMode;
extern void *D_800A2D40_A3940;
extern void *D_800A2D44_A3944;
extern void *D_800A2D48_A3948;
extern s32 gTempPosition;
extern Gfx D_8009A780_9B380[];
extern Gfx D_8009A7D0_9B3D0[];
extern u32 D_800A2D4C_A394C;
extern u32 D_800A2D50_A3950;
extern u8 D_800A2D54_A3954;

void renderCameraRelativeDisplayList(DisplayListObject *arg0);
void renderTexturedBillboardSprite(TexturedSpriteState *);
void renderTexturedBillboardSpriteTile(TexturedSpriteState *);
void renderRotatedBillboardSprite(RotatedBillboardSprite *);
void renderAlphaSprite(AlphaSpriteState *);
void renderAlphaBillboardSprite(AlphaSpriteState *);
void scheduleGameInitialization(void);
void prepareDisplayListRenderState(DisplayListObject *);
void setupDisplayListMatrix(DisplayListObject *);
void setupBillboardDisplayListMatrix(DisplayListObject *);
