#include "graphics.h"
#include "common.h"
#include "displaylist.h"
#include "player.h"
#include "rom_loader.h"
#include "task_scheduler.h"

USE_ASSET(_6A83F0);

typedef struct {
    void *musicBankBuffer;
    void *ptrBank;
    void *waveBank;
    s32 soundId;
    s32 soundSequence;
    s32 volume;
    s32 pan;
    void *audioChannel;
    s32 stoppingSpeed;
    f32 position;
    s32 voiceIndex;
    s32 unk2C;
    s32 unk30;
} GraphicsCommand;
extern GraphicsCommand gGraphicsCommand;

typedef struct {
    s16 soundId;
    s16 duration;
    s16 priority;
    s16 hasVolume;
    f32 volume;
    Vec3i position;
    s16 flags;
    u8 padding[2];
} RenderQueueItem;

typedef struct {
    /* 0x00 */ void *ptrBank;
    /* 0x04 */ void *musicDataBuffer;
    /* 0x08 */ void *musicBankBuffer;
    /* 0x0C */ void *currentAudioChannel;
    /* 0x10 */ s16 pendingMusicId;
    /* 0x12 */ u16 currentMusicId;
    /* 0x14 */ s16 musicFadeOutDuration;
    /* 0x16 */ s16 currentMusicVolume;
    /* 0x18 */ s16 targetMusicVolume;
    /* 0x1A */ s16 fadeCounter;
    /* 0x1C */ s8 musicVoiceIndex;
    /* 0x1D */ u8 musicFadeState;
    /* 0x1E */ u8 isFadingOut;
    /* 0x1F */ u8 unk1F;
    /* 0x20 */ s32 soundSequence;
    /* 0x24 */ void *soundEffectChannels[0xF];
    /* 0x60 */ s32 padding3;
    /* 0x64 */ s16 soundEffectIds[0x10];
    /* 0x84 */ s32 renderQueueCount;
    /* 0x88 */ RenderQueueItem renderQueue[32];
    /* 0x408 */ s32 bufferCount;
    /* 0x40C */ u8 bufferData[8][0x20];
    /* 0x50C */ s8 bufferIds[0x8];
    /* 0x514 */ s32 bufferFlags[8];
    /* 0x534 */ s32 audioInnerDistance;
    /* 0x538 */ s32 audioOuterDistance;
} GraphicsManager;
extern GraphicsManager *gGraphicsManager;

extern OSMesgQueue gfxTaskQueue;
extern OSMesgQueue gfxResultQueue;
extern s32 D_800937EC_943EC[];
extern s32 D_800937F0_943F0[];
extern s32 D_80093978_94578[];
extern s32 D_8009397C_9457C[];
extern s32 D_80093B00_94700;
extern s32 D_80092E28_93A28;
extern s32 D_80093308_93F08;

USE_ASSET(wavetables);

extern OSMesg gfxTaskQueueBuffer;
extern OSMesg gfxResultQueueBuffer;
extern u8 gMusicTrackVoiceMap[];
extern u8 D_80093BA5_947A5;
extern u8 D_80093BA6_947A6;
extern OSThread gfxCommThread;

void func_8005628C_56E8C(void);

void *startSoundEffect(s32, s32, s32, s32, s32);
void *func_80072960_73560(void *, s32);
void *func_80072A14_73614(void *);
void *func_80072CDC_738DC(void *, void *);

typedef struct {
    void *start;
    void *end;
    s32 size;
} GraphicsDataSegment;
extern GraphicsDataSegment D_800937E8_943E8[];
extern GraphicsDataSegment D_80093974_94574[];

