#include "common.h"
#include "displaylist.h"
#include "overlay.h"
#include "player.h"
#include "task_scheduler.h"

USE_ASSET(_6A83F0);

typedef struct {
    void *unk0;
    void *unk4;
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
    void *unk1C;
    s32 unk20;
    f32 unk24;
    s32 unk28;
    s32 unk2C;
    s32 unk30;
} GraphicsCommand;
extern GraphicsCommand D_800A2D10_A3910;

typedef struct {
    s16 unk0;
    s16 unk2;
    s16 unk4;
    s16 unk6;
    f32 unk8;
    u8 data[12];
    s16 flags;
    u8 padding[2];
} RenderQueueItem;

typedef struct {
    /* 0x00 */ void *unk0;
    /* 0x04 */ void *unk4;
    /* 0x08 */ void *unk8;
    /* 0x0C */ void *unkC;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ u16 unk12;
    /* 0x14 */ s16 unk14;
    /* 0x16 */ s16 unk16;
    /* 0x18 */ s16 flags;
    /* 0x1A */ s16 unk1A;
    /* 0x1C */ s8 unk1C;
    /* 0x1D */ u8 unk1D;
    /* 0x1E */ u8 unk1E;
    /* 0x1F */ u8 unk1F;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ void *unk24[0xF];
    /* 0x60 */ s32 padding3;
    /* 0x64 */ s16 unk64[0x10];
    /* 0x84 */ s32 renderQueueCount;
    /* 0x88 */ RenderQueueItem renderQueue[32];
    /* 0x408 */ s32 unk408;
    /* 0x40C */ u8 bufferData[8][0x20];
    /* 0x50C */ s8 bufferIds[0x8];
    /* 0x514 */ s32 bufferFlags[8];
    /* 0x534 */ s32 unk534;
    /* 0x538 */ s32 unk538;
} GraphicsManager;
extern GraphicsManager *gGraphicsManager;

extern OSMesgQueue gfxTaskQueue;
extern OSMesgQueue gfxResultQueue;
extern s32 D_800937EC_943EC[];
extern s32 D_800937F0_943F0[];
extern s32 D_80093978_94578[];
extern s32 D_8009397C_9457C[];
extern s32 D_80093B00_94700;
extern s32 D_80092E28_93A28;
extern s32 D_80093308_93F08;

USE_ASSET(wavetables);

extern void *D_800A2CE8_A38E8;
extern void *D_800A2D08_A3908;
extern u8 D_80093B84_94784[];
extern u8 D_80093BA5_947A5;
extern u8 D_80093BA6_947A6;
extern OSThread D_800A2998_A3598;

void *func_80058638_59238(void);
void func_800570BC_57CBC(void);
void func_80057124_57D24(void);
void func_800579E8_585E8(void *, s32);
void func_80057B70_58770(s32, s32, s32, f32, s32, s32, s32);
void func_80057CE4_588E4(s32, s32, s32, s32, s32, s32);
void func_80057E18_58A18(s32, s32, s32, s32, s32);
void func_80057F48_58B48(s32, s32, s32, s32);
void func_80058064_58C64(s32, s32, s32, s32);
