#include "player.h"
#include "audio_manager.h"
#include "common.h"

#define FORNEXT_DEPTH 4
#define MAX_SONGS 4
#define MUSFLAG_EFFECTS 1
#define MUSFLAG_SONGS 2
#define PTRFLAG_REMAPPED (1 << 31)
#define BASEOFFSET 48
#define U8_TO_FLOAT(c) (((c) & 128) ? -(256 - (c)) : (c))

typedef unsigned long musHandle;
typedef void (*LIBMUScb_marker)(musHandle, int);

typedef struct {
    u16 wave;
    u16 adsr;
    u8 pan;
    u8 pitch;
} drum_t;

typedef struct {
    /* 0x00 */ s32 num_channels;
    /* 0x04 */ u8 **channel_data;
    /* 0x08 */ u8 **volume_data;
    /* 0x0C */ u8 **pitchbend_data;
    /* 0x10 */ u8 *env_table;
    /* 0x14 */ s32 *drum_table;
} song_t;

typedef struct {
    u8 header_name[16];
    u32 flags;
    u32 wbk_name[3];
    u32 count;

    u8 *basenote;
    f32 *detune;
    ALWaveTable **wave_list;
} ptr_bank_t;

typedef struct {
    u8 *fxdata;
} fx_t;

typedef struct {
    s32 number_of_components;
    s32 number_of_effects;
    s32 num_waves;
    u32 flags;
    ptr_bank_t *ptr_addr;
    u16 *wave_table;
    fx_t effects[1];
} fx_header_t;

typedef struct {
    u8 command;
    u8 padding1;
    u8 padding2;
    u8 padding3;
    u32 data;
} fifo_t;

typedef struct {
    /* 0x000 */ s32 flags;
    /* 0x004 */ u8 *pdata;
    /* 0x008 */ void *pending;
    /* 0x00C */ u32 channel_frame;
    /* 0x010 */ s32 stopping;
    /* 0x014 */ s32 volume_frame;
    /* 0x018 */ u32 pitchbend_frame;
    /* 0x01C */ s32 stopping_speed;
    /* 0x020 */ f32 vib_amount;
    /* 0x024 */ f32 bendrange;
    /* 0x028 */ f32 old_frequency;
    /* 0x02C */ f32 base_note;
    /* 0x030 */ f32 freqoffset;
    /* 0x034 */ u8 *ppitchbend;
    /* 0x038 */ u8 *pvolume;
    /* 0x03C */ s32 note_end_frame;
    /* 0x040 */ u32 note_start_frame;
    /* 0x044 */ s32 handle;
    /* 0x048 */ s32 priority;
    /* 0x04C */ f32 last_note;
    /* 0x050 */ float port_base;
    /* 0x054 */ u32 release_frame;
    /* 0x058 */ f32 env_attack_calc;
    /* 0x05C */ f32 env_decay_calc;
    /* 0x060 */ f32 env_release_calc;
    /* 0x064 */ s32 env_speed_calc;
    /* 0x068 */ f32 vibrato;
    /* 0x06C */ f32 pitchbend_precalc;
    /* 0x070 */ f32 pitchbend;
    /* 0x074 */ song_t *song_addr;
    /* 0x078 */ fx_header_t *sample_bank;
    /* 0x07C */ u8 *pbase;
    /* 0x080 */ drum_t *pdrums;
    /* 0x084 */ u8 *ppitchbendbase;
    /* 0x088 */ u8 *pvolumebase;
    /* 0x08C */ f32 distort;
    /* 0x090 */ u32 sweep_frame;
    /* 0x094 */ s16 temscale;
    /* 0x096 */ u16 length;
    /* 0x098 */ u16 channel_tempo;
    /* 0x09A */ s16 volscale;
    /* 0x09C */ u16 old_volume;
    /* 0x09E */ u16 cont_vol_repeat_count;
    /* 0x0A0 */ u16 cont_pb_repeat_count;
    /* 0x0A2 */ u16 fx_addr;
    /* 0x0A4 */ s16 channel_tempo_save;
    /* 0x0A6 */ u16 count;
    /* 0x0A8 */ s16 fixed_length;
    /* 0x0AA */ s16 wave;
    /* 0x0AC */ s16 panscale;
    /* 0x0AE */ u16 cutoff;
    /* 0x0B0 */ u16 endit;
    /* 0x0B2 */ u8 vib_delay;
    /* 0x0B3 */ u8 ignore;
    /* 0x0B4 */ u8 port;
    /* 0x0B5 */ u8 transpose;
    /* 0x0B6 */ u8 ignore_transpose;
    /* 0x0B7 */ s8 velocity;
    /* 0x0B8 */ u8 volume;
    /* 0x0B9 */ u8 pan;
    /* 0x0BA */ u8 old_pan;
    /* 0x0BB */ s8 env_speed;
    /* 0x0BC */ u8 env_init_vol;
    /* 0x0BD */ u8 env_max_vol;
    /* 0x0BE */ u8 env_sustain_vol;
    /* 0x0BF */ u8 env_phase;
    /* 0x0C0 */ u8 env_current;
    /* 0x0C1 */ u8 env_count;
    /* 0x0C2 */ u8 env_attack_speed;
    /* 0x0C3 */ u8 env_decay_speed;
    /* 0x0C4 */ u8 env_release_speed;
    /* 0x0C5 */ u8 playing;
    /* 0x0C6 */ u8 reverb;
    u8 padding11;
    /* 0x0C8 */ u8 old_reverb;
    /* 0x0C9 */ u8 release_start_vol;
    /* 0x0CA */ u8 wobble_on_speed;
    /* 0x0CB */ u8 wobble_off_speed;
    /* 0x0CC */ u8 wobble_count;
    /* 0x0CD */ s8 wobble_current;
    /* 0x0CE */ u8 velocity_on;
    /* 0x0CF */ u8 default_velocity;
    /* 0x0D0 */ u8 sweep_speed;
    /* 0x0D1 */ u8 vib_speed;
    /* 0x0D2 */ u8 env_trigger_off;
    /* 0x0D3 */ u8 trigger_off;
    /* 0x0D4 */ s8 wobble_amount;
    /* 0x0D5 */ u8 sweep_timer;
    /* 0x0D6 */ u8 sweep_dir;
    /* 0x0D7 */ u8 for_stack_count;
    /* 0x0D8 */ f32 vib_precalc;
    /* 0x0DC */ u8 *for_stack[FORNEXT_DEPTH];
    /* 0x0EC */ u8 *for_stackvol[FORNEXT_DEPTH];
    /* 0x0FC */ u8 *for_stackpb[FORNEXT_DEPTH];
    /* 0x10C */ u16 for_vol_count[FORNEXT_DEPTH];
    /* 0x114 */ u16 for_pb_count[FORNEXT_DEPTH];
    /* 0x11C */ u8 for_count[FORNEXT_DEPTH];
    /* 0x120 */ u8 for_volume[FORNEXT_DEPTH];
    /* 0x124 */ u8 for_pitchbend[FORNEXT_DEPTH];

    u8 padding999[0xC];
} channel_t;

extern ALGlobals __libmus_alglobals;
extern ALVoice *mus_voices;
extern s32 ChangeCustomEffect(s32);
extern ALMicroTime mus_next_frame_time;
extern fx_header_t *libmus_fxheader_current;
extern fx_header_t *libmus_fxheader_single;

// bss
extern s32 mus_vsyncs_per_second;
extern channel_t *mus_channels;
extern s32 max_channels;
extern s32 mus_songfxchange_flag;

extern LIBMUScb_marker marker_callback;
extern s32 mus_last_fxtype;
extern s32 mus_current_handle;
extern s32 mus_random_seed;
extern ALPlayer plr_player;
extern u16 mus_master_volume_effects;
extern u16 mus_master_volume_songs;

u32 __muscontrol_flag;
fx_t *D_800A64F4_A70F4;
s32 *D_800A64F8_A70F8;
ALHeap audio_heap;
s32 D_800A6520_A7120;
s32 D_800A6524_A7124;
s32 D_800A6528_A7128;
void *D_800A652C_A712C;

void func_80072F54_73B54(void);
void func_80073738_74338(channel_t *cp, int x);
void func_8007335C_73F5C(channel_t *cp, int x);
